/*******************************************************************************
 * -----------------------------------------------------------------------------
 * description : CS검색 팝업
 *
 *
 * @ 수정일          수정자        수정내용
 * @ ---------------------------------------------------------------------------
 * @ 2020.12.23    안치열        최초생성
 * @
 ******************************************************************************/
'use strict';


  // --------------------------------------------------------------------------
  //html 컨텐츠 가지고 오기
  getContentsHtmlByPath("/contents/views/admin/ur/user/buyerPopup.html", function (){
    // html 컨텐츠 가지고 온 이후 callback
    // javascript import
    importScript("/js/controllers/admin/ur/user/buyerPopupController.js");
  });