
/*******************************************************************************
 * -----------------------------------------------------------------------------
 * description : 외부몰 문의관리
 * @
 * @ 수정일 			수정자 			수정내용
 * @ ------------------------------------------------------
 * @ 2021.07.22 	최윤지 			최초생성 @
 ******************************************************************************/
'use strict';

  // --------------------------------------------------------------------------
  // 변수 선언 - qnaController.js에서 사용할 전역변수 정의(중복 주의)
  // 문의유형 - 범위 :  MALL_TP.MALL (통합몰)
  //                  MALL_TP.OUTSOURCE (외부몰)
  // --------------------------------------------------------------------------
  var gbMallTp = 'MALL_TP.OUTSOURCE';
  var pageId = 'outMallQna';

  // --------------------------------------------------------------------------
  //html 컨텐츠 가지고 오기
  getContentsHtmlByPath('/contents/views/admin/customer/qna/qna.html', function (){
    // html 컨텐츠 가지고 온 이후 callback
    // javascript import
    importScript('/js/controllers/admin/customer/qna/qnaController.js');
  });